<a href="https://colab.research.google.com/github/emad550/ML/blob/master/Assignment6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [ ]:
import pandas as pd 
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

array([0, 1, 2, 3, 4])

In [ ]:
for i in (df.index.values):
  #print(i)
  if pd.isnull(df.FlightNumber[i]):
    df.FlightNumber[i]=df.FlightNumber[i-1]+10
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [ ]:
df[['From','To']]=df.From_To.str.split('_',expand=True)
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis       10075.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [ ]:
df_temp=df
df_temp.From_To=df_temp['From_To'].str.capitalize()
df_temp.From=df_temp['From'].str.capitalize()
df_temp.To=df_temp['To'].str.capitalize()
df_temp

            From_To  FlightNumber  ...      From         To
0      London_paris       10045.0  ...    London      Paris
1      Madrid_milan       10055.0  ...    Madrid      Milan
2  London_stockholm       10065.0  ...    London  Stockholm
3    Budapest_paris       10075.0  ...  Budapest      Paris
4   Brussels_london       10085.0  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [ ]:
df_temp.drop('From_To',axis=1,inplace=True)

KeyError: ignored

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [ ]:
# we have to defined how many column need to create 
c=0 
for i in (df_temp.index.values):
  if len(df_temp.RecentDelays[i])>c:
    #print(len(df_temp.RecentDelays[i]))
    #print(df_temp.RecentDelays[i])
    c=len(df_temp.RecentDelays[i])
for i in range(c):
  df_temp['delay',i+1]='Nan'

In [ ]:
#df_temp.drop(('delay',3),axis=1 ,inplace=True )
#df_temp['delay',1].loc[1]
#df_temp
for i in df.RecentDelays[2]:
  print (i)

for i in (df_temp.index.values):
  u=1
  for x in df_temp.RecentDelays[i]:
    df_temp['delay',u].loc[i]=x
    u=u+1
df_temp

24
43
87

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

   FlightNumber  RecentDelays  ... (delay, 2) (delay, 3)
0       10045.0      [23, 47]  ...         47        Nan
1       10055.0            []  ...        Nan        Nan
2       10065.0  [24, 43, 87]  ...         43         87
3       10075.0          [13]  ...        Nan        Nan
4       10085.0      [67, 32]  ...         32        Nan

[5 rows x 8 columns]

In [ ]:
df_temp

   FlightNumber  RecentDelays  ... (delay, 2) (delay, 3)
0       10045.0      [23, 47]  ...         47         13
1       10055.0            []  ...         87         13
2       10065.0  [24, 43, 87]  ...         43         87
3       10075.0          [13]  ...         87         13
4       10085.0      [67, 32]  ...         32         13

[5 rows x 8 columns]